{
  "home": {
    "title": "JESUS PEREZ",
    "roles": [
      "Desarrollador Full Stack",
      "Desarrollador de Videojuegos",
      "Fotógrafo"
    ],
    "downloadResume": "Descargar CV",
    "social": {
      "github": "Visita mi perfil de GitHub",
      "linkedin": "Conéctate conmigo en LinkedIn",
      "instagram": "Sígueme en Instagram"
    }
  },
  "aboutMe": {
    "title": "Sobre mí",
    "description": "Soy Jesús Pérez, un desarrollador de software apasionado que ama resolver problemas complejos con soluciones creativas. Comencé mi viaje en la programación hace algunos años, y ha sido un camino lleno de aprendizaje constante y mejora. Me especializo en el desarrollo frontend, donde me enfoco en crear interfaces amigables para el usuario, y en el desarrollo backend, donde trabajo en las partes esenciales que mantienen las aplicaciones y sitios web funcionando sin problemas.",
    "skillsTitle": "Habilidades"
  },
  "services": {
    "title": "Servicios",
    "items": [
      {
        "title": "Control de Versiones con Git",
        "description": "Mejora la eficiencia del flujo de trabajo con control de versiones avanzado y colaborativo utilizando Git.",
        "icon": "faGithub"
      },
      {
        "title": "Diseño de Aplicaciones",
        "description": "Diseños de aplicaciones intuitivos y centrados en el usuario con interfaces elegantes y experiencias de usuario optimizadas.",
        "icon": "faMobileButton"
      },
      {
        "title": "Desarrollo Web",
        "description": "Desarrollo web moderno para crear sitios dinámicos, receptivos y orientados al rendimiento.",
        "icon": "faCode"
      },
      {
        "title": "Desarrollo Backend",
        "description": "Soluciones backend robustas y escalables que impulsan la lógica y la gestión de datos de sus aplicaciones.",
        "icon": "faDatabase"
      },
      {
        "title": "Fotografía",
        "description": "Servicios profesionales de fotografía que capturan la esencia de su marca y mejoran la narración visual.",
        "icon": "faCamera"
      },
      {
        "title": "Trabajo Freelance",
        "description": "Servicios de desarrollo y diseño flexibles y adaptables para llevar sus proyectos al siguiente nivel.",
        "icon": "faLaptop"
      }
    ]
  },
  "projects": {
    "title": "Proyectos",
    "Lucky": {
      "title": "Lucky",
      "description": "\"Lucky\" es una aplicación para adoptar animales. En esta aplicación, tanto los usuarios que desean adoptar una mascota como los refugios de animales pueden registrarse para mostrar los animales disponibles para su adopción. De esta manera, los usuarios pueden elegir la mascota que mejor se adapte a ellos. La aplicación ha sido desarrollada utilizando React, Node.js, Express.js y MongoDB."
    },
    "Beats - Landing Page": {
      "title": "Beats",
      "description": "\"Beats - Landing Page\" es un proyecto personal donde he creado una réplica de la página principal de Beats utilizando HTML, CSS y JavaScript."
    },
    "GameStore": {
      "title": "GameStore",
      "description": "\"GameStore\" es una pequeña tienda de videojuegos donde los usuarios pueden ingresar, registrarse y \"comprar\" juegos. Pueden explorar juegos mejor calificados y filtrarlos por precio. Está construido con JavaScript, Node.js, Express.js y MongoDB."
    },
    "BMW - Landing Page": {
      "title": "BMW",
      "description": "\"BMW - Landing Page\" es un proyecto académico donde he creado una réplica de la página principal de BMW utilizando HTML y SASS."
    },
    "Slack - Landing Page": {
      "title": "Slack",
      "description": "\"Slack - Landing Page\" es un proyecto académico donde he creado una réplica de la página principal de Slack utilizando HTML y CSS."
    }
  },
  "contact": {
    "title": "Contáctame",
    "description": "<h1>¡Hola!</h1><p>¡Me alegro verte por aquí! Siempre estoy listo para una buena charla. Si tienes alguna pregunta, idea o simplemente quieres saludar, ¡no dudes en hacerlo!.</p><p>Puedes escribirme directamente a mi correo electrónico <strong>jesusperez_14@hotmail.com</strong> y estaré encantado de responderte lo antes posible.</p><p>También puedes encontrarme en las redes sociales.</p><p>¡Espero saber de ti pronto!</p>",
    "downloadResume": "Descargar CV",
    "name": "Nombre",
    "email": "Correo electrónico",
    "message": "Mensaje",
    "submit": "Enviar"
  },
  "navbar": {
    "home": "Inicio",
    "about": "Sobre Mí",
    "services": "Servicios",
    "portfolio": "Portafolio",
    "contact": "Contacto"
  }
}