{
  "home": {
    "title": "JESUS PEREZ",
    "roles": ["Full Stack Developer", "Video Games Developer", "Photographer"],
    "downloadResume": "Download Resume",
    "social": {
      "github": "Visit my GitHub profile",
      "linkedin": "Connect with me on LinkedIn",
      "instagram": "Follow me on Instagram"
    }
  },
  "aboutMe": {
    "title": "About me",
    "description": "I'm Jesús Pérez, a passionate software developer who loves solving complex problems with creative solutions. I started my journey in programming some years ago, and it has been a path filled with constant learning and improvement. I specialize in frontend development, where I focus on creating user-friendly interfaces, and in backend development, where I work on the essential parts that keep applications and websites running smoothly.",
    "skillsTitle": "Skills"
  },
  "services": {
    "title": "Services",
    "featuresTitle": "Key Features",
    "benefitsTitle": "Benefits",
    "items": [
      {
        "title": "Git Version Control",
        "description": "Enhance workflow efficiency with advanced and collaborative version control using Git.",
        "icon": "faGithub",
        "fullDescription": "Git version control is essential for modern software development. I offer expertise in implementing and managing Git workflows, ensuring smooth collaboration and efficient code management for your projects.",
        "features": [
          "Branch management and merging strategies",
          "Code review processes",
          "Conflict resolution",
          "Git hooks and automation"
        ],
        "benefits": [
          "Improved team collaboration",
          "Better code quality through review processes",
          "Easy tracking of project history and changes",
          "Simplified deployment and rollback procedures"
        ]
      },
      {
        "title": "App Design",
        "description": "Intuitive, user-centered app designs with sleek interfaces and optimized user experiences.",
        "icon": "faMobileButton",
        "fullDescription": "I create app designs that not only look great but also provide an intuitive and engaging user experience. My approach focuses on understanding user needs and translating them into functional, aesthetically pleasing designs.",
        "features": [
          "User-centered design process",
          "Wireframing and prototyping",
          "UI/UX design",
          "Responsive and adaptive layouts"
        ],
        "benefits": [
          "Increased user engagement and retention",
          "Improved app usability and accessibility",
          "Consistent brand representation across platforms",
          "Reduced development time through clear design specifications"
        ]
      },
      {
        "title": "Web Development",
        "description": "Modern web development to create dynamic, responsive, and performance-oriented sites.",
        "icon": "faCode",
        "fullDescription": "I specialize in creating modern, responsive websites that not only look great but also perform exceptionally well. Using the latest web technologies and best practices, I ensure your web presence is both impactful and efficient.",
        "features": [
          "Responsive design implementation",
          "Front-end frameworks (React, Vue, Angular)",
          "Performance optimization",
          "Progressive Web Apps (PWAs)"
        ],
        "benefits": [
          "Fast-loading, SEO-friendly websites",
          "Cross-browser and cross-device compatibility",
          "Improved user engagement and conversion rates",
          "Easy maintenance and scalability"
        ]
      },
      {
        "title": "Backend Development",
        "description": "Robust and scalable back-end solutions powering the logic and data management of your applications.",
        "icon": "faDatabase",
        "fullDescription": "I develop robust and scalable backend solutions that form the foundation of your applications. From API design to database management, I ensure your backend can handle growth and maintain performance under load.",
        "features": [
          "RESTful and GraphQL API development",
          "Database design and optimization",
          "Server-side application logic",
          "Cloud integration (AWS, Google Cloud, Azure)"
        ],
        "benefits": [
          "Scalable architecture to support growth",
          "Improved data security and integrity",
          "Efficient data processing and retrieval",
          "Easy integration with front-end and third-party services"
        ]
      },
      {
        "title": "Photography",
        "description": "Professional photography services that capture your brand's essence and enhance visual storytelling.",
        "icon": "faCamera",
        "fullDescription": "I offer professional photography services that go beyond just taking pictures. My goal is to capture the essence of your brand or project, creating visual narratives that engage and inspire your audience.",
        "features": [
          "Product photography",
          "Event coverage",
          "Lifestyle and branding shoots",
          "Photo editing and retouching"
        ],
        "benefits": [
          "High-quality visuals for marketing materials",
          "Consistent brand imagery across platforms",
          "Increased engagement on social media and websites",
          "Professional documentation of events and milestones"
        ]
      },
      {
        "title": "Freelancing",
        "description": "Flexible and adaptable development and design services to take your projects to the next level.",
        "icon": "faLaptop",
        "fullDescription": "As a freelancer, I offer a wide range of development and design services tailored to your specific needs. My flexible approach allows me to adapt to various project requirements and deliver high-quality results.",
        "features": [
          "Custom software development",
          "UI/UX design",
          "Project management",
          "Technical consulting"
        ],
        "benefits": [
          "Cost-effective solutions for businesses of all sizes",
          "Access to diverse skill sets and expertise",
          "Flexible scheduling and project scoping",
          "Direct communication and quick turnaround times"
        ]
      }
    ]
  },
  "projects": {
    "title": "Projects",
    "BeerHub": {
      "title": "BeerHub",
      "description": "\"BeerHub\" is a global platform designed for beer enthusiasts to discover, rate, and favorite beers from around the world. Currently in early access, the platform starts with 10 brands from Spain and Portugal, with new countries and regions added weekly."
    },
    "Lucky": {
      "title": "Lucky",
      "description": "\"Lucky\" is an app for adopting animals. In this app, both users who wish to adopt a pet and animal shelters can register to showcase the animals available for adoption. This way, users can choose the pet that suits them best. The app has been developed using React, Node.js, Express.js, and MongoDB."
    },
    "Beats - Landing Page": {
      "title": "Beats",
      "description": "\"Beats - Landing Page\" is a small personal project where I`ve created a replica of BEATS`s landing page using HTML, CSS and JavaScript."
    },
    "GameStore": {
      "title": "GameStore",
      "description": "\"GameStore\" is a small video game shop where users can enter, register, and \"purchase\" games. They can explore top-rated games and filter them by price. It's built using JavaScript, Node.js, Express.js, and MongoDB."
    },
    "BMW - Landing Page": {
      "title": "BMW",
      "description": "\"BMW - Landing Page\" is an academic project where I've created a replica of BMW's landing page using HTML and SASS."
    },
    "Slack - Landing Page": {
      "title": "Slack",
      "description": "\"Slack - Landing Page\" is an academic project where I've created a replica of Slack's landing page using HTML and CSS."
    }
  },
  "contact": {
    "title": "Contact Me",
    "description": 
"<h1>Hello!</h1><p>It's great to see you here! I'm always ready for a good chat. If you have any questions, ideas, or just want to say hello, feel free to do so!</p><p>You can write to me directly at my email <strong>jesusperez_14@hotmail.com</strong> and I'll be happy to get back to you as soon as possible.</p><p>You can also find me on social media.</p><p>Looking forward to hearing from you soon!</p>",
    "downloadResume": "Download Resume",
    "name": "Name",
    "email": "Email",
    "message": "Message",
    "submit": "Submit"
  },
  "navbar": {
    "home": "Home",
    "about": "About Me",
    "services": "Services",
    "portfolio": "Portfolio",
    "contact": "Contact"
  }
}
